## Read and Write CSV and XLS files

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
%pip install xlrd
%pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\users\vansh\appdata\roaming\python\python313\site-packages (2.0.2)
Note: you may need to restart the kernel to use updated packages.
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
df=pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

#### write df to csv

In [5]:
df.to_csv('new.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
df.to_csv('new_noIndex.csv', index=False) #index=False CSV file mai index ko save hone se rokta hai....dataframe ke display se index ko remove nhi karta!!
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### Write DF to excel

In [7]:
df.to_excel('new_noIndex.xlsx', sheet_name='weather_data')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## Group By

In [8]:
df=pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [9]:
g=df.groupby('city')
g

In [10]:
# g=df.groupby('city')['temperature'].mean()
# g

In [11]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

## To get a Specific Group

In [12]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

## Max temperature in Each city

In [13]:
for city, city_df in g:
    print(city ,city_df['temperature'].max())

mumbai 92
new york 36
paris 54

In [14]:
g.min()
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [15]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [16]:
india_weather= pd.DataFrame({
    'city' : ['mumbai', 'Pune' , 'Pali', 'Delhi'],
    'temp' : [32, 32, 45, 45],
    'humidity': [80, 60, 70, 30]
})

india_weather

     city  temp  humidity
0  mumbai    32        80
1    Pune    32        60
2    Pali    45        70
3   Delhi    45        30

In [23]:
us_weather= pd.DataFrame({
    'city' : ['Paris', 'London' , 'NewYork'],
    'temp' : [25 , 10 , 9],
    'humidity' : [30,50, 130]
})

us_weather

      city  temp  humidity
0    Paris    25        30
1   London    10        50
2  NewYork     9       130

#### .Concat() --> Rows and columns ko simply jod deta...koi common column ya index hona jaruri nhi hai

In [ ]:
df = pd.concat([india_weather, us_weather])  
df

      city  temp  humidity
0   mumbai    32        80
1     Pune    32        60
2     Pali    45        70
3    Delhi    45        30
0    Paris    25        30
1   London    10        50
2  NewYork     9       130

In [ ]:
## if we want continuous index
df= pd.concat([india_weather, us_weather], ignore_index=True)
df

      city  temp  humidity
0   mumbai    32        80
1     Pune    32        60
2     Pali    45        70
3    Delhi    45        30
4    Paris    25        30
5   London    10        50
6  NewYork     9       130

In [ ]:
df= pd.concat([india_weather, us_weather], axis=1) #axis = 1 means columns ko jodna hai
df

     city  temp  humidity     city  temp  humidity
0  mumbai    32        80    Paris  25.0      30.0
1    Pune    32        60   London  10.0      50.0
2    Pali    45        70  NewYork   9.0     130.0
3   Delhi    45        30      NaN   NaN       NaN

## Merge DataFrames

In [30]:
temp_df= pd.DataFrame({
    'city' : ['Mumbai', 'Pune' , 'Delhi'],
    'temp' : [32, 26, 34]
})
temp_df

     city  temp
0  Mumbai    32
1    Pune    26
2   Delhi    34

In [38]:
humidity_df= pd.DataFrame({
    'city' : ['Mumbai', 'Delhi' , 'Pune', 'chennai'],
    'humidity' : [80, 90, 70, 60]

})
humidity_df

      city  humidity
0   Mumbai        80
1    Delhi        90
2     Pune        70
3  chennai        60

### .merge() --> merge two dataframes on the basis of common columns or indices......sirf matching rows ko jodta hai..SqL JOIN jaise kaam

In [39]:
#.merge() function  merges two dataframes without explicitly mention index
df= pd.merge(temp_df, humidity_df, on='city')
df

     city  temp  humidity
0  Mumbai    32        80
1    Pune    26        70
2   Delhi    34        90

## Outer-Join

In [ ]:
df= pd.merge(temp_df, humidity_df, on='city' , how='outer') # outer join non common values ko bhi include karta hai...
df

      city  temp  humidity
0    Delhi  34.0        90
1   Mumbai  32.0        80
2     Pune  26.0        70
3  chennai   NaN        60

# Numerical Indexing (.loc VS .iloc)

In [43]:
df= pd.DataFrame([1,2,3,4,5,6,7,8,9,10], index=[49, 48, 47, 46, 45 ,1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [ ]:
df.loc[3] # .loc --> index ke according kam karta hai...in this case index 3 ki value dega

0    8
Name: 3, dtype: int64

In [ ]:
df.loc[45:5] #loc me slicing inclusive hoti hai----> in this case 5th index is included

     0
45   5
1    6
2    7
3    8
4    9
5   10

In [ ]:
df.iloc[3] # .iloc --> position ke according kam karta hai...in this case 3rd row(position) ki value dega

0    4
Name: 46, dtype: int64

In [ ]:
df.iloc[3:5] #iloc me slicing exclusive hoti hai----> in this case 5th index is excluded

    0
46  4
45  5

In [ ]:
#error ayega kyuki 45th position (row) exist nhi karti hai
df.iloc[45]